from ...attrs import LIKE_NUM


MIM = "م"
ZWNJ_O_MIM = "‌ام"
YE_NUN = "ین"


_num_words = set(
    """
یک
دو
سه
چهار
پنج
شش
هفت
هشت
نه
ده
یازده
دوازده
سیزده
چهارده
پانزده
شانزده
هفده
هجده
نوزده
بیست
بیست و یک
بیست و دو
بیست و سه
بیست و چهار
بیست و پنج
بیست و شش
بیست و هفت
بیست و هشت
بیست و نه
سی
سی و یک
سی و دو
سی و سه
سی و چهار
سی و پنج
سی و شش
سی و هفت
سی و هشت
سی و نه
چهل
چهل و یک
چهل و دو
چهل و سه
چهل و چهار
چهل و پنج
چهل و شش
چهل و هفت
چهل و هشت
چهل و نه
پنجاه
پنجاه و یک
پنجاه و دو
پنجاه و سه
پنجاه و چهار
پنجاه و پنج
پنجاه و شش
پنجاه و هفت
پنجاه و هشت
پنجاه و نه
شصت
شصت و یک
شصت و دو
شصت و سه
شصت و چهار
شصت و پنج
شصت و شش
شصت و هفت
شصت و هشت
شصت و نه
هفتاد
هفتاد و یک
هفتاد و دو
هفتاد و سه
هفتاد و چهار
هفتاد و پنج
هفتاد و شش
هفتاد و هفت
هفتاد و هشت
هفتاد و نه
هشتاد
هشتاد و یک
هشتاد و دو
هشتاد و سه
هشتاد و چهار
هشتاد و پنج
هشتاد و شش
هشتاد و هفت
هشتاد و هشت
هشتاد و نه
نود
نود و یک
نود و دو
نود و سه
نود و چهار
نود و پنج
نود و شش
نود و هفت
نود و هشت
نود و نه
صد
صفر
یک
دو
سه
چهار
پنج
شش
شیش
هفت
هشت
نه
ده
یازده
دوازده
سیزده
چهارده
پانزده
پونزده
شانزده
شونزده
هفده
هجده
هیجده
نوزده
بیست
سی
چهل
پنجاه
شصت
هفتاد
هشتاد
نود
صد
یکصد
یک‌صد
دویست
سیصد
چهارصد
پانصد
پونصد
ششصد
شیشصد
هفتصد
هفصد
هشتصد
نهصد
هزار
میلیون
میلیارد
بیلیون
بیلیارد
تریلیون
تریلیارد
کوادریلیون
کادریلیارد
کوینتیلیون
""".split()
)

_ordinal_words = set(
    """
اول
سوم
سی‌ام""".split()
)

_ordinal_words.update({num + MIM for num in _num_words})
_ordinal_words.update({num + ZWNJ_O_MIM for num in _num_words})
_ordinal_words.update({num + YE_NUN for num in _ordinal_words})


def like_num(text):
    """
    check if text resembles a number
    """
    text = (
        text.replace(",", "")
        .replace(".", "")
        .replace("،", "")
        .replace("٫", "")
        .replace("/", "")
    )
    if text.isdigit():
        return True
    if text in _num_words:
        return True
    if text in _ordinal_words:
        return True
    return False


LEX_ATTRS = {LIKE_NUM: like_num}
